Repository: Ariiiba/MySCCTtest
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: This version is up to date.
ru_ru: Вы используете новейшую версию.

source: Specify your Twitch Settings to use this feature
ru_ru: Укажите настройки Twitch для использования этой возможности

source: Automatically update the title of your twitch channel in the background.
ru_ru: Автоматическое обновление заголовка вашего Twitch-канала в фоновом режиме.

source: Specify your Nightbot Settings to use this feature
ru_ru: Укажите настройки Nightbot для использования этой возможности

source: Automatically update the commands of your nightbot in the background.
ru_ru: Автоматическое обновление команд nightbot в фоновом режиме.

source: Warning: Map '{}' not found!
ru_ru: Внимание: Карта '{}' Не найдена!

source: A new version {} is available.
ru_ru: Доступна новая версия {}.

source: Update to new version?
ru_ru: Загрузить новую версию?

source: New SCC-Tool Version
ru_ru: Новая версия SCC-Tool

source: Don't show on startup.
ru_ru: Не показывать при запуске.

source: A new version {} is available on GitHub!
ru_ru: Новая версия {} доступна на GitHub!

source: Forbidden - Do you have permission?
ru_ru: Запрещено! У вас есть разрешение?

source: Unauthorized - Refresh your token!
ru_ru: Неавторизован - обновите ваш токен!

source: Too Many Requests.
ru_ru: Слишком много запросов.

source: Nightbot command '{}' was already set to '{}'
ru_ru: Nightbot команда '{}' уже установлена в '{}'

source: Deleted command '{}'
ru_ru: Удалить команду '{}'

source: Updated Nightbot command '{}' to '{}'
ru_ru: Обновить команду Nightbot '{}' на '{}'

source: Updated Twitch title of {} to: "{}"
ru_ru: Изменить заголовок Twitch из {} на: "{}"

source: Not Found - Channel '{}' not found.
ru_ru: Не найдено - канал '{}' не найден.

source: Updated data files!
ru_ru: Данные обновлены!

source: scctool: Succesfully recived access to Nightbot - you can close this tab now.
ru_ru: scctool: Успешно получен доступ к Nightbot - теперь вы можете закрыть эту вкладку.

source: scctool: Succesfully recived access to Twitch - you can close this tab now.
ru_ru: scctool: Успешно получен доступ к Twitch - теперь вы можете закрыть эту вкладку.

source: StarCraft Casting Tool is up to date.
ru_ru: Новершая версия StarCraft Casting Tool.

source: The new version {} is available!
ru_ru: Доступна новая версия {}!

source: StarCraft Casting Tool - About
ru_ru: StarCraft Casting Tool - О программе

source: Settings
ru_ru: Настройки

source: Connections
ru_ru: Соединения

source: Edit Intro-Settings and API-Settings for Twitch and Nightbot
ru_ru: Редактировать настройки превью и API для Twitch Nightbot

source: Styles
ru_ru: Стили

source: Misc
ru_ru: Разное

source: Info && Links
ru_ru: Информация и ссылки

source: About
ru_ru: О программе

source: Readme
ru_ru: Прочти

source: Check for new version
ru_ru: Проверить наличие обновлений

source: Changelog
ru_ru: История изменений

source: Donate
ru_ru: Поддержать

source: Language
ru_ru: Язык

source: Match Grabber for AlphaTL && RSTL
ru_ru: Граббер матчей для AlphaTL и RSTL

source: Custom Match
ru_ru: Кастомный матч

source: Open in Browser
ru_ru: Открыть в браузере

source: Match-URL:
ru_ru: URL матча:

source: Load Data from URL
ru_ru: Загрузить данные по URL

source: Match Format:
ru_ru: Формат матча:

source: Best of
ru_ru: Лучший из

source: "Best of 6/4": First, a Bo5/3 is played and the ace map gets extended to a Bo3 if needed; Best of 2: Bo3 with only two maps played.
ru_ru: Бо5, играются все карты. При равном счёте играется эйс матч до двух побед.

source: but at least
ru_ru: но как минимум

source: Minimum number of maps played (even if the match is decided already)
ru_ru: Минимальное количество сыгранных карт (Даже если матч уже завершен)

source: maps
ru_ru: карты

source: All-Kill Format
ru_ru: Формат All-Kill

source: Winner stays and is automatically placed into the next set
ru_ru: Победитель автоматически переносится в следующий сет

source: Select for solo (non-team matches)
ru_ru: Выбрать для дуэлей (не командных игр)

source: Apply Format
ru_ru: Применить формат

source: Optionally specify the Match-URL, e.g., for Nightbot commands
ru_ru: Опционально введите URL матча, например для команд Nightbot

source: Specify the Match-URL of your Custom Match
ru_ru: Введите URL вашего матча

source: Reset Match Data
ru_ru: Сброс данных матча

source: Match Data
ru_ru: Данные матча

source: Choose your team
ru_ru: Выберите вашу команду

source: Swap teams and logos.
ru_ru: Своп команды и логотипы.

source: League:
ru_ru: Лига:

source: Maps \ Teams:
ru_ru: Карты \ Команды:

source: Player {} of team {}
ru_ru: Игрок {} из команды {}

source: Set the score
ru_ru: Установить счет

source: Map {}
ru_ru: Карта {}

source: Tasks
ru_ru: Задачи

source: Update Twitch Title
ru_ru: Обновить заголовок на Twitch

source: Update Nightbot
ru_ru: Обновить Nightbot

source: Reset Score
ru_ru: Сбросить счет

source: Update OB&S Data
ru_ru: Обновить данные OB&S

source: Shortcut: {}
ru_ru: горячая клавиша: {}

source: Background Tasks
ru_ru: Задачи в фоновом режиме

source: Auto Score Update
ru_ru: Автообновление счета

source: Automatically detects the outcome of SC2 matches that are played/observed in your SC2-client and updates the score accordingly.
ru_ru: Автоматически определяет вывод о текущем матче из вашего клиента SC2 и обновляет счет.

source: Provide Player Intros
ru_ru: Заставки игроков

source: Update player intros files via SC2-Client-API
ru_ru: Обновить заставки игроков с помощью SC2-Client-API

source: Set Ingame Score
ru_ru: Задать счет

source: Automatically sets the score of your ingame UI-interface at the begining of a game.
ru_ru: Автоматически задает счет внутри вашего игрового интерфейса в начале игры.

source: Toggle Production Tab
ru_ru: Включать вкладку "Производство"

source: Automatically toggles the production tab of your ingame UI-interface at the begining of a game.
ru_ru: Автоматически переключается на вкладку Производство в начале игры.

source: Auto Twitch Update
ru_ru: Автообновление Twitch

source: Auto Nightbot Update
ru_ru: Автообновление Nightbot

source: Only Windows
ru_ru: Только Windows

source: Applying Custom Match...
ru_ru: Применение матча...

source: Reading {}...
ru_ru: Чтение {}...

source: Updating Nightbot Command...
ru_ru: Обновление команды Nightbot...

source: Updating Twitch Title...
ru_ru: Обновление заголовка Twitch...

source: Updating OBS Data...
ru_ru: Обновление данных OBS...

source: Resetting Score...
ru_ru: Сброс счета...

source: Updating Score...
ru_ru: Обновление счета...

source: Intros && Hotkeys
ru_ru: Интро и хоткеи

source: Intro Hotkeys
ru_ru: Интро хоткеи

source: Player 1
ru_ru: Игрок 1

source: Player 2
ru_ru: Игрок 2

source: Debug
ru_ru: Отладка

source: Intro Settings
ru_ru: Интро настройки

source: Sound Volume:
ru_ru: Громкость:

source: Seconds
ru_ru: Секунд

source: Display Duration:
ru_ru: Длительность показа:

source: Animation:
ru_ru: Анимация:

source: Name of the Twitch channel that should be updated
ru_ru: Название канала Twitch, который должен быть обновлен

source: The connected twitch user needs to have editor rights for this channel.
ru_ru: Подключенный пользователь twitch должен обладать правами редактора для этого канала.

source: Press 'Get' to generate a token
ru_ru: Нажмите 'Получить' для генерации токена

source: Press 'Get' to generate a new token.
ru_ru: Нажмите 'Получить' для генерации нового токена.

source: Get
ru_ru: Получить

source: Access-Token:
ru_ru: Токен доступа:

source: Available placeholders:
ru_ru: Доступные заглушки:

source: Test
ru_ru: Тест

source: Title Template:
ru_ru: Шаблон заголовка:

source: Press 'Get' to generate a token.
ru_ru: Нажмите 'Получить', чтобы создать токен.

source: Add Command
ru_ru: Добавить команду

source: Cancel
ru_ru: Отмена

source: &Save && Close
ru_ru: Сохранить и закрыть

source: Save data?
ru_ru: Сохранить данные?

source: Do you want to save the data?
ru_ru: Вы хотите сохранить данные?

source: Output:
ru_ru: Вывод:

source: message, e.g.,
ru_ru: сообщение,

source: Delete
ru_ru: Удалить

source: Search
ru_ru: Поиск

source: Results
ru_ru: Результаты

source: Use Selected Logo
ru_ru: Использовать выбранный логотип

source: Liqupedia Image Search
ru_ru: Поиск изображения Liquipedia

source: Results for '{}': {}
ru_ru: Результаты для '{}': {}

source: Open on Liquipedia
ru_ru: Открыть на Liquipedia

source: Use as Team Logo
ru_ru: Использовать как логотип команды

source: Logo Team 1
ru_ru: Логотип команды 1

source: Load from File
ru_ru: Загрузить из файла

source: Load from URL
ru_ru: Загрузить по ссылке

source: Search Liquipedia
ru_ru: Поиск в Liquipedia

source: Add to Favorites
ru_ru: Добавить в избранное

source: Remove
ru_ru: Удалить

source: Logo Team 2
ru_ru: Логотип команды 2

source: Favorites
ru_ru: Избранное

source: Last Used
ru_ru: Последний

source: Logo Manager
ru_ru: Логотип

source: Set Team 1 Logo
ru_ru: Установить логотип команды 1

source: Set Team 2 Logo
ru_ru: Установить логотип команды 2

source: Remove from Favorites
ru_ru: Удалить из избранного

source: Select Team Logo
ru_ru: Выбрать логотип команды

source: Supported Images
ru_ru: Поддерживаемые изображения

source: Logo from URL
ru_ru: Логотип по ссылке

source: URL of Team Logo
ru_ru: Ссылка логотипа команды

source: {} is not a valid URL.
ru_ru: {} недопустимая ссылка.

source: Miscellaneous Settings
ru_ru: Другие настройки

source: Map Manager
ru_ru: Менеджер карт

source: Alias
ru_ru: Псевдоним

source: AlphaTL && Ingame Score
ru_ru: AlphaTL и счет в игре

source: Download transparent Banner of the Match
ru_ru: Скачать прозрачный баннер матча

source: Set Ingame Score Task
ru_ru: Настройка счета в игре

source: Automatically press Ctrl+X to apply the correct player order ingame.
ru_ru: Автоматически нажимать Ctrl+X, чтобы применить правильный порядок к игрокам в игре.

source: This will ensure that the player of the first team is always on the left/top in the ingame Observer UI.
ru_ru: Гарантирует, что игрок первой команды всегда находится слева/сверху в Observer UI игры.

source: Automatically press Ctrl+N before OCR to display player names.
ru_ru: Нажмите Ctrl+N перед OCR, чтобы автоматически отобразить имена игроков.

source: This is recommended for Standard and Gawliq Observer UI.
ru_ru: Рекомендуется для Standard и Gawliq Observer UI.

source: Automatically press Ctrl+Shift+S to display the ingame score
ru_ru: Автоматически нажимать Ctrl+Shift+S для вывода счета в игре

source: Ctrl+Shift+S is needed for the WCS-Gameheart Oberserver Overlay, but disables the sound for other overlays.
ru_ru: Ctrl+Shift+S необходим для наложения WCS-Gameheart Observer Overlay, но отключает звук для других оверлеев.

source: Automatically press Ctrl+Shift+C to toogle the clan tag
ru_ru: Автоматически нажимать Ctrl+Shift+C, чтобы поменять тег клана

source: Automatically press Ctrl+Shift+R to toogle the race icon
ru_ru: Автоматически нажимать Ctrl+Shift+R, чтобы поменять иконку расы

source: time(s)
ru_ru: время

source: Players
ru_ru: Игроки

source: Teams
ru_ru: Команды

source: Swap my favorite team always to the left
ru_ru: Поменяйте мою любимую команду всегда налево

source: Player and team aliases are replaced by the actual name when encountered by the match grabber. Additionally, SC2 player names listed as aliases are replaced in the intros and used to identify players by the automatic background tasks "Auto Score Update" and "Set Ingame Score".
ru_ru: Псевдонимы игрока и команды заменяются фактическими именами когда их собирает граббер матчей. Кроме того, имена игроков SC2, перечисленные как псевдонимы, заменяются в заставках и используются для определения игроков фоновыми задачами «Автообновление счета» и «Задать счет».

source: Player Aliases
ru_ru: Псевдонимы игроков

source: Add Alias
ru_ru: Добавить псевдоним

source: Player Name
ru_ru: Имя игрока

source: Team Aliases
ru_ru: Псевдонимы команды

source: Team Name
ru_ru: Название команды

source: Alias of {}
ru_ru: Псевдоним {}

source: Error
ru_ru: Ошибка

source: Optical Character Recognition for Automatic Setting of Ingame Score
ru_ru: Оптическое распознавание персонажей для автоматической настройки счета в игре

source: Activate Optical Character Recognition
ru_ru: Активировать оптическое распознавание персонажей

source: Tesseract-OCR Executable
ru_ru: Исполняемый файл Tesseract-OCR

source: Browse...
ru_ru: Выбрать...

source: Sometimes the order of players given by the SC2-Client-API differs from the order in the Observer-UI resulting in a swapped match score. To correct this via Optical Character Recognition you have to download {} and install and select the exectuable below, if it is not detected automatically.
ru_ru: Иногда порядок игроков предоставленный SC2-Client-API отличается от порядка в результатах Обсервера. Для изменения этого с помощью оптического распознавания вам необходимо скачать {}, установить и выбрать исполняемый файл ниже, если он не определился автоматически.

source: This feature is only available in Windows.
ru_ru: Эта возможность доступна только в Windows.

source: Select Tesseract-OCR Executable
ru_ru: Выберите исполняемый файл Tesseract-OCR

source: Executable
ru_ru: Исполняемый файл

source: All files
ru_ru: Все файлы

source: Add from Liquipedia
ru_ru: Добавить из Liquipedia

source: Add from File
ru_ru: Добавить из файла

source: Rename
ru_ru: Переименовать

source: Change Image
ru_ru: Изменить изображение

source: Map Name
ru_ru: Название карты

source: "{}" is not a valid map name.
ru_ru: "{}" недопустимое имя карты.

source: Duplicate Entry
ru_ru: Повторяющийся ввод

source: Map is already in list! Overwrite?
ru_ru: Карта уже в списке! Переписать?

source: Select Map Image (> 500x500px recommended)
ru_ru: Выберите изображение карты (> 500x500px рекомендовано)

source: Map not found
ru_ru: Карта не найдена

source: "{}" was not found on Liquipedia.
ru_ru: "{}" не найден на Liquipedia.

source: Map {} is already in list! Overwrite?
ru_ru: Карта {} уже в списке! Переписать?

source: Delete map?
ru_ru: Удалить карту?

source: Delete '{}' permanently?
ru_ru: Удалить '{}'?

source: Colors
ru_ru: Цвета

source: Font
ru_ru: Шрифт

source: Style Settings
ru_ru: Настройки стилей

source: Box Map Icons:
ru_ru: Пиктограммы карт:

source: Show in Browser
ru_ru: Показать в браузере

source: Landscape Map Icons:
ru_ru: Ландшафт карт:

source: Score:
ru_ru: Счет:

source: Intros:
ru_ru: Заставки:

source: Apply
ru_ru: Применить

source: Note that to make these changes visible in OBS you have to refresh the cache of your browser sources.
ru_ru: Чтобы изменения были видны в OBS вы должны обновить кэш вашего браузера.

source: Default Border:
ru_ru: Граница по умолчанию:

source: Winner Highlight:
ru_ru: Победитель:

source: Win:
ru_ru: Победа:

source: Lose:
ru_ru: Поражение:

source: Undecided:
ru_ru: Не определено:

source: Not played:
ru_ru: Не сыграно:

source: Warning: Using a custom font instead of the regular font defined in the Icon Styles can lead to unitentional appereance.
ru_ru: Предупреждение: Использование пользовательского шрифта вместо обычного, определенного в стилях значков, может привести к нежелательному виду.

source: The proper way is to create a custom skin.
ru_ru: Правильный способ - создать пользовательский скин.

source: Activate Custom Font
ru_ru: Активировать пользовательский шрифт

source: Custom Font
ru_ru: Пользовательский шрифт

source: Map Downloader
ru_ru: Загрузчик карт

source: Downloading {}
ru_ru: Загрузка {}

source: Not set
ru_ru: Не задано

source: Set Hotkey
ru_ru: Установить хоткей

source: Clear
ru_ru: Очистить

source: Press a Hotkey for {}
ru_ru: Нажмите горячую клавишу для {}

source: Logo Downloader
ru_ru: Загрузчик логотипов

source: Updater
ru_ru: Обновления

source: Updating to a new version...
ru_ru: Обновление на новую версию...

source: Downloading a new version: Total file size {}, Time remaining {}.
ru_ru: Загрузка новой версии: размер файла {}, осталось времени {}.

source: Select
ru_ru: Выбрать

source: Default
ru_ru: По умолчанию

source: Name
ru_ru: Имя

source: Remove with Aliases
ru_ru: Удалить с помощью псевдонимов

source: Remove Alias
ru_ru: Удалить псевдоним

source: Collecting data...
ru_ru: Сбор данных...

source: Extracting data...
ru_ru: Получение данных...

source: Done.
ru_ru: Готово.

source: Downloading required files...: Total file size {}, Time remaining {}.
ru_ru: Загрузка необходимых файлов...: размер файла {}, осталось времени {}.
